[Linux就该这样学](https://www.linuxprobe.com/)  

1. man 命令【[分为 9 章节](https://www.cnblogs.com/webnote/p/5734586.html)】
    > 说明书命令，最快了解一个命令的用法的命令  
    > whatis echo：可以查看该命令属于哪一个章节  
    > man 1 echo：查看 1 章节的 echo 命令的用法  
    > Ctrl+d：向下半屏  
    > Ctrl+u：向上半屏  
    > 12g：跳转到第 12 行  
    > G：跳转到最后一行  
    > g：跳转到第一行  
    > j：向下一行  
    > k：向上一行  
    > 空格：向下一页  
    > Page down：向下一页  
    > Page up：向上一页  
    > Home：首行  
    > End：尾行  
    > /：从上至下搜索    
    > ?：从下至上搜索  
    > n：定位到下一个搜索的关键词  
    > N：定位到上一个搜索的关键词  
2. echo 命令
    > 格式为“echo [字符串 | $变量]”  
    > echo $SHELL  
3. date 命令 年月日时分秒【date +%Y%m】
    > date [选项] [+指定的格式]  
    > 设置系统时间 date -s '20180919 10:21:09'  
    > 完整例子 date +%Y年%y年%m月%d日%t%H时%I时%M分%S秒  
    > %a 本地化语言 周几的简写  
    > %A 本地化语言 周几的全写  
    > %b 本地化语言 月份的简写  
    > %B 本地化语言 月份的全写  
    > %Y 阿拉伯数字 年份的全写  
    > %y 阿拉伯数字 年份的简写  
    > %y 阿拉伯数字 年份的简写  
    > %y 阿拉伯数字 年份的简写  
    > %y 阿拉伯数字 年份的简写  
    > %m 阿拉伯数字 月份的简写  
    > %d 阿拉伯数字 日的简写  
    > %F 阿拉伯数字 年月日  
    > %s 秒自从1970以后 时间戳  
    > %S 秒 0~59  
    > %j 一年第几天  
    > %u 1~7 周几  
    > %w 0~6 周几  
    > %t 跳格  
4. reboot 重启
5. poweroff 关机
6. wget 下载文件
    > wget [参数] 下载地址  
    > wget [参数] 下载地址  
    > -b 后台下载  
    > -p 下载所有资源，包括图片视频  
    > -P 指定保存目录  
    > -c 断点续传  
    > -r 递归下载  
7. ps 【查看进程状态】
    > 注意 ps -a 和 ps a 不同哦  
    > 好像可以直接 ps aux
    > -a 显示所有进程，包括其他用户  
    > -u 用户以及其他详细信息  
    > -x 显示没有控制终端的进程
8. Linux 进程状态  RSDZT
    > 运行 R：进程正在运行或在运行队列中等待。  
    > 中断 S：进程处于休眠中，当某个条件形成后或者接收到信号时，则脱离该状态。    
    > 不可中断 D：进程不响应系统异步信号，即便用kill命令也不能将其中断。  
    > 僵死 Z：进程已经终止，但进程描述符依然存在, 直到父进程调用wait4()系统函数后将进程释放。  
    > 停止 T：进程收到停止信号后停止运行。
9. top 命令 【Linux的任务管理器】

10. pidof [参数] [服务名称]
    > 查询指定服务名称的 pid  
    > 比如拿到 pid 就可以用 netstat -latp | grep pid 查询到监听的端口和域名了  
    > pidof sshd     
    > pidof -s sshd 只返回单独的pid     
11. kill [参数] [进程PID]
    >  
12. killall [参数] [服务名称]
13. 运行的命令后面加上 & 符号，可以让命令后台执行
14. ifconfig
15. uname -a 命令用于查看系统内核与系统版本等信息
16. uptime 查看系统负载。top 命令都能看到
17. free 用于显示当前系统中内存的使用量信息，格式为“free [-h]”。
    > free -h（human的意思，以人类常用单位显示）  
18. who 和 w 用于查看当前登入主机的用户终端信息，格式为“who [参数]”
19. last 命令用于查看所有系统的登录记录，格式为“last [参数]”
20. history 命令用于显示历史执行过的命令，格式为“history [-c]”。
    > /etc/profile  中的HISTSIZE 变量控制记录历史的条数，默认1000  
    > history -c 清空历史  
    > !number  执行历史中指定序号的命令  
    > 历史命令会被保存到用户家目录中的.bash_history文件中
21. sosreport 命令用于收集系统配置及架构信息并输出诊断文档，格式为sosreport。
    > 貌似 CentOS 不自带此命令，只有 redhat 才有
22. 烂熟于心：pwd cd ls -lad
23. cat 命令用于查看纯文本文件（内容较少的），格式为“cat [选项] [文件]”。 
    > -n 显示行号
24. more 命令用于查看纯文本文件（内容较多的），格式为“more [选项]文件”。
25. head命令用于查看纯文本文档的前N行，格式为“head [选项] [文件]”。
