// md是否支持html取决于平台环境 注释可使用HTML的注释 

// 1、倾斜：*内容* 或者 _内容_
// 2、加粗：**内容**
// 3、倾斜加粗：***内容***
// 4、1 级标题：#内容# 或者 ===========
// 5、2 级标题：##内容## 或者 -------------
// 6、3 级标题：###内容###
// 7、4 级标题：####内容####
// 8、5 级标题：#####内容#####
// 9、6 级标题：######内容######
// 10、图片只是在【超链接】前面加了个!   变量式是在定义的前面加 !
// 11、超链接：
    // 行内式：<url> 或者 尖括号可选  或者  [文字](url title)
    // 变量式：定义--》[name]: url title   使用：[文字][name]   方便多次引用
        // 隐式设置   [name]: url title   使用 [name]

// 12、分割线：至少3个* 或者 至少3个_ 。   中间可以有空格，不能有其他。    至少三个 ---  是页眉分割线，文字会加粗
// 13、代码句：用反引号包裹
// 14、代码块：tab距离左侧4个空格即可
// 14、代码块：三个单反引号“`”包裹
// 15、行内代码引用：反引号包裹
// 16、一级引用：> 123   引用换行，末尾加两个空格
// 16、二级引用：>> 123   引用换行，末尾加两个空格
// 16、三级引用：>>> 123   引用换行，末尾加两个空格
// 17、无需列表： * + -   后面要有一个空格
// 18、有序列表 1. 内容      英文点号后要有空格
// 19、单个回车是空格 两个空格或者一个tab是换行 连续回车是分段
// 20、tab缩进是 嵌套
// 21、表格： 根据冒号 对齐方式
    // | 项目      |    价格 | 数量  |
    // | :-------- | --------:| :--: |
    // | Computer  | 1600 元 |  5   |
    // | Phone     |   12 元 |  12  |
    // | Pipe      |    1 元 | 234  |
// 22、文档目录：[TOC]    MD会自动根据结构生成文档目录
// 23、转义字符：\
// 24、
// 25、
// 26、